<?xml version="1.0"?>
<net name="gaze-estimation-adas-0002" version="3" batch="1">
	<layers>
		<layer name="right_eye_image" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1421/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="102" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="103" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1385/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="4">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128" />
				<weights offset="3736" size="128" />
			</blobs>
		</layer>
		<layer name="105" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3864" size="64" />
				<weights offset="3928" size="18432" />
			</blobs>
		</layer>
		<layer name="106" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22360" size="256" />
				<weights offset="22616" size="36864" />
			</blobs>
		</layer>
		<layer name="107" type="ReLU" precision="FP32" id="7">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1358/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="8">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59480" size="256" />
				<weights offset="59736" size="256" />
			</blobs>
		</layer>
		<layer name="109" type="Convolution" precision="FP32" id="9">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59992" size="128" />
				<weights offset="60120" size="73728" />
			</blobs>
		</layer>
		<layer name="left_eye_image" type="Input" precision="FP32" id="10">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1376/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="11">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="133848" size="12" />
				<weights offset="133860" size="12" />
			</blobs>
		</layer>
		<layer name="93" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="133872" size="128" />
				<weights offset="134000" size="3456" />
			</blobs>
		</layer>
		<layer name="94" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1403/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="14">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="137456" size="128" />
				<weights offset="137584" size="128" />
			</blobs>
		</layer>
		<layer name="96" type="Convolution" precision="FP32" id="15">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="137712" size="64" />
				<weights offset="137776" size="18432" />
			</blobs>
		</layer>
		<layer name="97" type="Convolution" precision="FP32" id="16">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="156208" size="256" />
				<weights offset="156464" size="36864" />
			</blobs>
		</layer>
		<layer name="98" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1367/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="18">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="193328" size="256" />
				<weights offset="193584" size="256" />
			</blobs>
		</layer>
		<layer name="100" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="193840" size="128" />
				<weights offset="193968" size="73728" />
			</blobs>
		</layer>
		<layer name="110" type="Concat" precision="FP32" id="20">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="111" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="267696" size="512" />
				<weights offset="268208" size="294912" />
			</blobs>
		</layer>
		<layer name="112" type="ReLU" precision="FP32" id="22">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1430/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="23">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="563120" size="512" />
				<weights offset="563632" size="512" />
			</blobs>
		</layer>
		<layer name="114" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="564144" size="256" />
				<weights offset="564400" size="294912" />
			</blobs>
		</layer>
		<layer name="115" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="859312" size="512" />
				<weights offset="859824" size="294912" />
			</blobs>
		</layer>
		<layer name="116" type="ReLU" precision="FP32" id="26">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1439/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="27">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1154736" size="512" />
				<weights offset="1155248" size="512" />
			</blobs>
		</layer>
		<layer name="118" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1155760" size="256" />
				<weights offset="1156016" size="294912" />
			</blobs>
		</layer>
		<layer name="119" type="Convolution" precision="FP32" id="29">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1450928" size="1024" />
				<weights offset="1451952" size="589824" />
			</blobs>
		</layer>
		<layer name="120" type="ReLU" precision="FP32" id="30">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1412/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="31">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2041776" size="1024" />
				<weights offset="2042800" size="1024" />
			</blobs>
		</layer>
		<layer name="122" type="Convolution" precision="FP32" id="32">
			<data dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2043824" size="2048" />
				<weights offset="2045872" size="4718592" />
			</blobs>
		</layer>
		<layer name="head_pose_angles" type="Input" precision="FP32" id="33">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="gaze_vector/DimData_const" type="Const" precision="FP32" id="34">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764464" size="8" />
			</blobs>
		</layer>
		<layer name="141/DimData_const" type="Const" precision="FP32" id="35">
			<output>
				<port id="0">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764472" size="16" />
			</blobs>
		</layer>
		<layer name="137/Output_0/Data__const" type="Const" precision="FP32" id="36">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764488" size="8" />
			</blobs>
		</layer>
		<layer name="138" type="Reshape" precision="FP32" id="37">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="129/Output_0/Data__const" type="Const" precision="FP32" id="38">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764496" size="8" />
			</blobs>
		</layer>
		<layer name="130" type="Reshape" precision="FP32" id="39">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="139" type="Concat" precision="FP32" id="40">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>515</dim>
				</port>
			</output>
		</layer>
		<layer name="141" type="Reshape" precision="FP32" id="41">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>515</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="142" type="Convolution" precision="FP32" id="42">
			<data dilations="1,1" group="1" kernel="1,1" output="320" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6764504" size="1280" />
				<weights offset="6765784" size="659200" />
			</blobs>
		</layer>
		<layer name="144" type="ReLU" precision="FP32" id="43">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="145" type="Convolution" precision="FP32" id="44">
			<data dilations="1,1" group="1" kernel="1,1" output="80" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7424984" size="320" />
				<weights offset="7425304" size="102400" />
			</blobs>
		</layer>
		<layer name="146" type="ReLU" precision="FP32" id="45">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1394/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="46">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7527704" size="320" />
				<weights offset="7528024" size="320" />
			</blobs>
		</layer>
		<layer name="148" type="Convolution" precision="FP32" id="47">
			<data dilations="1,1" group="1" kernel="1,1" output="3" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7528344" size="12" />
				<weights offset="7528356" size="960" />
			</blobs>
		</layer>
		<layer name="gaze_vector" type="Reshape" precision="FP32" id="48">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="37" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="35" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="40" to-port="1" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="2" to-layer="42" to-port="0" />
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="45" to-port="0" />
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>100</name>
			<min>-2.765508, -6.437644, -4.868212, -3.514556, -3.865396, -6.056087, -5.710018, -6.037680, -7.449595, -8.140613, -8.617761, -3.735240, -5.727517, -2.909717, -2.516973, -6.668499, -5.022795, -5.272068, -2.152714, -4.778913, -3.994660, -9.379577, -4.520582, -8.285379, -6.355030, -5.736840, -5.693730, -5.216896, -6.627616, -5.769481, -7.241579, -2.624114</min>
			<max>7.007332, 2.517837, 2.846542, 4.599612, 5.362570, 3.375519, 7.015963, 4.235282, 3.989481, 1.901333, 5.370168, 4.033927, 7.361913, 6.412776, 8.236792, 2.821771, 3.043787, 2.456539, 8.155058, 3.434334, 8.531931, 5.741255, 3.612966, 2.790967, 4.100777, 3.471082, 4.099439, 3.616868, 5.894740, 4.421639, 2.475292, 4.252252</max>
		</layer>
		<layer>
			<name>102</name>
			<min>-0.536303, -0.799824, -1.141477, -0.601025, -0.974093, -0.753289, -0.503685, -0.986396, -0.985419, -0.653135, -1.036253, -0.770787, -0.924838, -1.054001, -0.910745, -1.136524, -0.783081, -1.179853, -0.723498, -0.854795, -1.203860, -1.140968, -0.909317, -1.185943, -0.830551, -0.684140, -1.190160, -0.612540, -0.790736, -0.622864, -0.804742, -1.313155</min>
			<max>0.867075, 1.160162, 1.351213, 0.594408, 0.860669, 0.724080, 0.567482, 0.675826, 0.833974, 1.051275, 1.132619, 0.569085, 1.311800, 1.029317, 1.037922, 1.218859, 1.093121, 0.160662, 0.929332, 1.122879, 0.950433, 0.095803, 1.037937, 0.807651, 0.450060, 0.789539, 0.627488, 0.817680, 0.265261, 0.432769, 1.203123, 1.181237</max>
		</layer>
		<layer>
			<name>103</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>0.867075, 1.160162, 1.351213, 0.594408, 0.860669, 0.724080, 0.567482, 0.675826, 0.833974, 1.051275, 1.132619, 0.569085, 1.311800, 1.029317, 1.037922, 1.218859, 1.093121, 0.160662, 0.929332, 1.122879, 0.950433, 0.095803, 1.037937, 0.807651, 0.450060, 0.789539, 0.627488, 0.817680, 0.265261, 0.432769, 1.203123, 1.181237</max>
		</layer>
		<layer>
			<name>105</name>
			<min>-4.464659, -3.552472, -2.220114, -9.788163, -4.612533, -13.132295, -6.976190, -3.597963, -4.002155, -5.639457, -2.942210, -2.567236, -3.242719, -2.395953, -2.379302, -0.579881</min>
			<max>6.061908, 1.397980, 10.032749, 3.156786, 6.548258, 5.164880, 2.899423, 4.884625, 4.826621, 8.386342, 3.614610, 6.039413, 5.271983, 3.541585, 5.804366, 9.016329</max>
		</layer>
		<layer>
			<name>106</name>
			<min>-9.277237, -10.942576, -7.493039, -12.729155, -6.292487, -13.291435, -13.774426, -3.904337, -8.866975, -15.205221, -12.330122, -14.717535, -7.140175, -10.249831, -13.223107, -12.586779, -7.207767, -5.544952, -17.071497, -9.943964, -9.757252, -11.534405, -13.214638, -8.518451, -6.218239, -7.320405, -17.493578, -10.875682, -10.253937, -7.974297, -9.739175, -8.086686, -7.176636, -8.538741, -16.468283, -9.363658, -8.571486, -9.962192, -10.650410, -12.785249, -13.366621, -15.543645, -11.659545, -6.878429, -12.010925, -18.279924, -7.279464, -10.094723, -11.646928, -9.078186, -6.990794, -12.756841, -9.140035, -8.892116, -8.792034, -12.108919, -7.245791, -9.125012, -5.898884, -5.860210, -9.511747, -4.993652, -9.546240, -8.799252</min>
			<max>8.483637, 6.981644, 3.334794, 8.695181, 7.760667, 6.918510, 6.417542, 6.828666, 3.886599, 6.703919, 2.086886, 5.709602, 3.082811, 4.817352, 5.137338, 8.820885, 8.378798, 9.978422, 4.461286, 8.960758, 6.797657, 6.471591, 8.226345, 10.983699, 4.145854, 2.112134, 3.521123, 6.840708, 7.440514, 6.391494, 6.445103, 7.514631, 8.605244, 4.344188, 2.515774, 3.641317, 5.440232, 5.870129, 7.924425, 5.827071, 5.036786, 6.963116, 8.650251, 8.843431, 7.055054, 6.812639, 5.153749, 9.221937, 4.732496, 6.430485, 8.460783, 2.341959, 4.222686, 6.188090, 6.662895, 8.225422, 6.440413, 5.959862, 5.991694, 9.344635, 5.016459, 4.188577, 6.558413, 4.251951</max>
		</layer>
		<layer>
			<name>107</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>8.483637, 6.981644, 3.334794, 8.695181, 7.760667, 6.918510, 6.417542, 6.828666, 3.886599, 6.703919, 2.086886, 5.709602, 3.082811, 4.817352, 5.137338, 8.820885, 8.378798, 9.978422, 4.461286, 8.960758, 6.797657, 6.471591, 8.226345, 10.983699, 4.145854, 2.112134, 3.521123, 6.840708, 7.440514, 6.391494, 6.445103, 7.514631, 8.605244, 4.344188, 2.515774, 3.641317, 5.440232, 5.870129, 7.924425, 5.827071, 5.036786, 6.963116, 8.650251, 8.843431, 7.055054, 6.812639, 5.153749, 9.221937, 4.732496, 6.430485, 8.460783, 2.341959, 4.222686, 6.188090, 6.662895, 8.225422, 6.440413, 5.959862, 5.991694, 9.344635, 5.016459, 4.188577, 6.558413, 4.251951</max>
		</layer>
		<layer>
			<name>109</name>
			<min>-21.321962, -13.377363, -8.419641, -8.423504, -12.027334, -6.154389, -6.624800, -6.536848, -15.210478, -8.627060, -6.483191, -8.464930, -9.803572, -9.126451, -9.177616, -7.480524, -18.239601, -8.275034, -3.534472, -9.144251, -7.482124, -4.950501, -7.719818, -1.734756, -15.825651, -4.886770, -6.296018, -4.056566, -23.589209, -8.270778, -9.470514, -6.226983</min>
			<max>7.616969, 5.136014, 6.227960, 4.889962, 10.240979, 11.241991, 9.169103, 12.578873, 4.299130, 8.129278, 12.559235, 8.489420, 6.438341, 7.283831, 2.571110, 6.049584, 9.924838, 11.272128, 16.470783, 8.375909, 10.803061, 13.819585, 5.506298, 13.337957, 7.358653, 12.801931, 10.322289, 12.487091, 6.201837, 11.433209, 13.809365, 5.222551</max>
		</layer>
		<layer>
			<name>110</name>
			<min>-2.765508, -6.437644, -4.868212, -3.514556, -3.865396, -6.056087, -5.710018, -6.037680, -7.449595, -8.140613, -8.617761, -3.735240, -5.727517, -2.909717, -2.516973, -6.668499, -5.022795, -5.272068, -2.152714, -4.778913, -3.994660, -9.379577, -4.520582, -8.285379, -6.355030, -5.736840, -5.693730, -5.216896, -6.627616, -5.769481, -7.241579, -2.624114, -21.321962, -13.377363, -8.419641, -8.423504, -12.027334, -6.154389, -6.624800, -6.536848, -15.210478, -8.627060, -6.483191, -8.464930, -9.803572, -9.126451, -9.177616, -7.480524, -18.239601, -8.275034, -3.534472, -9.144251, -7.482124, -4.950501, -7.719818, -1.734756, -15.825651, -4.886770, -6.296018, -4.056566, -23.589209, -8.270778, -9.470514, -6.226983</min>
			<max>7.007332, 2.517837, 2.846542, 4.599612, 5.362570, 3.375519, 7.015963, 4.235282, 3.989481, 1.901333, 5.370168, 4.033927, 7.361913, 6.412776, 8.236792, 2.821771, 3.043787, 2.456539, 8.155058, 3.434334, 8.531931, 5.741255, 3.612966, 2.790967, 4.100777, 3.471082, 4.099439, 3.616868, 5.894740, 4.421639, 2.475292, 4.252252, 7.616969, 5.136014, 6.227960, 4.889962, 10.240979, 11.241991, 9.169103, 12.578873, 4.299130, 8.129278, 12.559235, 8.489420, 6.438341, 7.283831, 2.571110, 6.049584, 9.924838, 11.272128, 16.470783, 8.375909, 10.803061, 13.819585, 5.506298, 13.337957, 7.358653, 12.801931, 10.322289, 12.487091, 6.201837, 11.433209, 13.809365, 5.222551</max>
		</layer>
		<layer>
			<name>111</name>
			<min>-26.917995, -23.484653, -33.106003, -19.982149, -34.538170, -24.456530, -24.824692, -16.848961, -24.567318, -51.482094, -23.200630, -23.639071, -27.046501, -26.560051, -27.822849, -38.923595, -37.373047, -30.815283, -32.548836, -17.456985, -46.838436, -28.436993, -34.360035, -23.304035, -26.900869, -28.778564, -37.800316, -21.410854, -31.126932, -28.921482, -31.109823, -40.287773, -25.137932, -46.088696, -22.013725, -30.897779, -39.903858, -32.890362, -30.756344, -24.023682, -43.241531, -31.547520, -40.907089, -36.463982, -39.807610, -26.955942, -37.683056, -35.796329, -16.016970, -41.228729, -13.959026, -33.992393, -69.305367, -29.622028, -30.577110, -35.830399, -24.498789, -26.675968, -34.634796, -28.025089, -33.244629, -27.798981, -26.124489, -46.466927, -8.532412, -22.254990, -22.326292, -36.030128, -27.636841, -32.383438, -32.228977, -18.468267, -31.839411, -39.469303, -38.024422, -33.930923, -29.863678, -38.935204, -28.389187, -24.978077, -39.602379, -28.860849, -21.841892, -38.924751, -30.241283, -26.638409, -31.309929, -38.354553, -24.218336, -33.779659, -37.089821, -33.819191, -33.009979, -29.609631, -35.285320, -37.382957, -36.575581, -29.265165, -39.283985, -21.181337, -51.148460, -38.117020, -25.325537, -40.790543, -27.734264, -35.090721, -42.032684, -21.349716, -25.549496, -31.391270, -23.837660, -43.549850, -41.473183, -29.037842, -34.352119, -21.463072, -32.861008, -33.278561, -37.880356, -35.400948, -44.449837, -48.454033, -40.482155, -28.693897, -29.223339, -29.995808, -36.267197, -23.422764</min>
			<max>10.129190, 12.614727, 14.211458, 22.799576, 12.473590, 13.605381, 16.013195, 16.452971, 23.744165, 16.058605, 27.952747, 17.500750, 25.902588, 16.851671, 24.959679, 14.223783, 25.139734, 13.917391, 20.117682, 13.251482, 7.905623, 26.650970, 19.882189, 11.986868, 21.649689, 21.973095, 12.634709, 9.898766, 21.966427, 17.096516, 15.315884, 16.554394, 21.087719, 9.807579, 12.508708, 20.555620, 14.535303, 17.096859, 27.105656, 19.444042, 13.245418, 26.197216, 17.836054, 22.893826, 13.337805, 20.396574, 20.917929, 33.437996, 9.020077, 9.960780, 21.223068, 22.979633, 26.146156, 14.842276, 20.044283, 22.219837, 14.667574, 23.133057, 21.749222, 25.320168, 19.271137, 17.133944, 16.857508, 41.251488, 7.768900, 24.249292, 7.244679, 11.917755, 8.303655, 24.864491, 15.264643, 18.882225, 35.875702, 16.373405, 9.415442, 11.915877, 17.389708, 12.683656, 15.208145, 14.812189, 14.332545, 8.914146, 13.307301, 26.573095, 29.811092, 19.913570, 26.973263, 28.049034, 16.003960, 21.098703, 12.581691, 14.858421, 14.883091, 19.175749, 7.873462, 14.933903, 26.102222, 14.221121, 22.778683, 18.271093, 20.989597, 25.364450, 28.288460, 11.634699, 11.328204, 17.779642, 11.988155, 21.004206, 14.071913, 4.838295, 27.317352, 17.340109, 22.287792, 20.308128, 16.890217, 15.367390, 21.213066, 24.892052, 15.922596, 18.628109, 18.909836, 46.126701, 22.634205, 18.396242, 23.656239, 21.484558, 17.356951, 22.134676</max>
		</layer>
		<layer>
			<name>112</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>10.129190, 12.614727, 14.211458, 22.799576, 12.473590, 13.605381, 16.013195, 16.452971, 23.744165, 16.058605, 27.952747, 17.500750, 25.902588, 16.851671, 24.959679, 14.223783, 25.139734, 13.917391, 20.117682, 13.251482, 7.905623, 26.650970, 19.882189, 11.986868, 21.649689, 21.973095, 12.634709, 9.898766, 21.966427, 17.096516, 15.315884, 16.554394, 21.087719, 9.807579, 12.508708, 20.555620, 14.535303, 17.096859, 27.105656, 19.444042, 13.245418, 26.197216, 17.836054, 22.893826, 13.337805, 20.396574, 20.917929, 33.437996, 9.020077, 9.960780, 21.223068, 22.979633, 26.146156, 14.842276, 20.044283, 22.219837, 14.667574, 23.133057, 21.749222, 25.320168, 19.271137, 17.133944, 16.857508, 41.251488, 7.768900, 24.249292, 7.244679, 11.917755, 8.303655, 24.864491, 15.264643, 18.882225, 35.875702, 16.373405, 9.415442, 11.915877, 17.389708, 12.683656, 15.208145, 14.812189, 14.332545, 8.914146, 13.307301, 26.573095, 29.811092, 19.913570, 26.973263, 28.049034, 16.003960, 21.098703, 12.581691, 14.858421, 14.883091, 19.175749, 7.873462, 14.933903, 26.102222, 14.221121, 22.778683, 18.271093, 20.989597, 25.364450, 28.288460, 11.634699, 11.328204, 17.779642, 11.988155, 21.004206, 14.071913, 4.838295, 27.317352, 17.340109, 22.287792, 20.308128, 16.890217, 15.367390, 21.213066, 24.892052, 15.922596, 18.628109, 18.909836, 46.126701, 22.634205, 18.396242, 23.656239, 21.484558, 17.356951, 22.134676</max>
		</layer>
		<layer>
			<name>114</name>
			<min>-7.813746, -8.361431, -7.102776, -11.981213, -5.384513, -4.156443, -7.371780, -5.959572, -6.026966, -15.513443, -6.276360, -7.543932, -13.405613, -9.361801, -5.505066, -7.439830, -15.154546, -19.863163, -4.896707, -7.377481, -6.096763, -8.370957, -9.292651, -6.695952, -4.868809, -7.281993, -8.119904, -14.256063, -6.877476, -15.876747, -5.621008, -11.523121, -8.713420, -8.505304, -4.494704, -13.508039, -10.258534, -6.981003, -2.531632, -8.356358, -6.582501, -5.809522, -11.803303, -9.495006, -2.412207, -5.238351, -26.292267, -11.193279, -8.021055, -5.354204, -9.899085, -8.845853, -9.432821, -6.085474, -6.224459, -10.118158, -3.914140, -7.363543, -5.544833, -19.123980, -6.877074, -6.101657, -7.476881, -12.687116</min>
			<max>17.240349, 8.407295, 20.736485, 4.238046, 11.082754, 7.473298, 7.098620, 11.567892, 9.573783, 6.839286, 8.872778, 7.059560, 6.181520, 9.125551, 8.557037, 14.227255, 7.998314, 6.021375, 8.781179, 9.381624, 13.602171, 6.377268, 5.707337, 6.134129, 8.687612, 11.844021, 9.468678, 5.948818, 9.351867, 3.718569, 8.308732, 5.388261, 7.097696, 5.504376, 10.191456, 3.400075, 9.975669, 6.939974, 14.153666, 13.525700, 5.576666, 13.314054, 5.904565, 8.228156, 21.139103, 10.414188, 2.080437, 8.537932, 14.791584, 7.453599, 4.302639, 9.801160, 8.160655, 7.476701, 6.542805, 6.550296, 13.236026, 6.488332, 7.793711, 4.481100, 7.853369, 5.149253, 7.456901, 7.157825</max>
		</layer>
		<layer>
			<name>115</name>
			<min>-16.048840, -40.849873, -39.405701, -29.881262, -32.518356, -40.697197, -22.681210, -30.788992, -35.568970, -52.286942, -24.995350, -16.796663, -42.931412, -30.557358, -34.026741, -9.964274, -26.314251, -27.736416, -20.354893, -40.894836, -19.802933, -40.292740, -27.454216, -38.352959, -33.916805, -25.299644, -43.983929, -38.029758, -18.878815, -33.934845, -54.328827, -34.094799, -28.275766, -31.271776, -25.853001, -16.970825, -27.891520, -29.457136, -30.793947, -33.545979, -38.724796, -27.424423, -30.192165, -47.048050, -30.995560, -25.372889, -49.561878, -40.803329, -23.498655, -47.081139, -19.678354, -33.216919, -35.995823, -33.247082, -29.298204, -33.629601, -18.694904, -38.975906, -30.565517, -24.304214, -20.519627, -33.387119, -47.879356, -46.840469, -29.155495, -30.074894, -29.727688, -36.876568, -34.832245, -30.126957, -28.460238, -49.891159, -41.678463, -39.045643, -24.519682, -29.660963, -33.687836, -28.428793, -25.714373, -38.326641, -24.804037, -25.356668, -32.798531, -23.721609, -53.199112, -40.822685, -30.603029, -35.623245, -35.900398, -27.847534, -33.353355, -23.849850, -24.853014, -36.870075, -27.769648, -20.023041, -28.795685, -32.655586, -34.611172, -49.540852, -34.618710, -34.710735, -27.808449, -28.759548, -50.718140, -19.655106, -28.437742, -27.618036, -27.286953, -54.219891, -43.133369, -24.448837, -28.227064, -48.418201, -47.873837, -26.022310, -29.217505, -27.980646, -34.333309, -37.225094, -32.401363, -29.914417, -46.250389, -32.968758, -44.091175, -38.478691, -43.220295, -20.102795</min>
			<max>21.362909, 8.904178, 12.222202, 15.462420, 18.531555, 13.270274, 8.716784, 19.117256, 14.874450, 11.356342, 25.136610, 22.880863, 13.683536, 29.830408, 13.356670, 13.158758, 9.697123, 19.142984, 20.230770, 26.908735, 16.312119, 12.679632, 26.151405, 15.173876, 37.311825, 32.821350, 12.180285, 26.737396, 18.640860, 16.714043, 6.428856, 4.882286, 20.949207, 26.790167, 28.740295, 10.460667, 17.377037, 17.219028, 14.763496, 9.472965, 15.925097, 21.220543, 27.454262, 13.230049, 15.924565, 24.124039, 14.745475, 13.845498, 18.355394, 14.282803, 15.563580, 10.879385, 19.887865, 13.596032, 17.410044, 20.482359, 20.882812, 15.978056, 25.201035, 11.329133, 14.594303, 23.173267, 14.173738, 30.972273, 23.646481, 18.168289, 22.698790, 28.380493, 8.438467, 18.264790, 12.133291, 6.331882, 21.258423, 7.839678, 10.214481, 15.611152, 26.110422, 17.508373, 7.181643, 34.287537, 9.827909, 20.607315, 18.717184, 14.403511, 26.323017, 24.976254, 12.786324, 22.058407, 12.491165, 29.944521, 25.560911, 24.509895, 8.844536, 25.867962, 13.633333, 9.785448, 15.509007, 18.762001, 9.568683, 8.045438, 17.255489, 20.260229, 24.026293, 17.116573, 13.316404, 14.078362, 21.071033, 14.099616, 28.754555, 24.097994, 32.617897, 44.334915, 10.496092, 24.061855, 11.461531, 14.680668, 24.525742, 29.383858, 7.088848, 6.693507, 14.264862, 15.160813, 11.989246, 8.258560, 30.855118, 8.047870, 10.763214, 13.499168</max>
		</layer>
		<layer>
			<name>116</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>21.362909, 8.904178, 12.222202, 15.462420, 18.531555, 13.270274, 8.716784, 19.117256, 14.874450, 11.356342, 25.136610, 22.880863, 13.683536, 29.830408, 13.356670, 13.158758, 9.697123, 19.142984, 20.230770, 26.908735, 16.312119, 12.679632, 26.151405, 15.173876, 37.311825, 32.821350, 12.180285, 26.737396, 18.640860, 16.714043, 6.428856, 4.882286, 20.949207, 26.790167, 28.740295, 10.460667, 17.377037, 17.219028, 14.763496, 9.472965, 15.925097, 21.220543, 27.454262, 13.230049, 15.924565, 24.124039, 14.745475, 13.845498, 18.355394, 14.282803, 15.563580, 10.879385, 19.887865, 13.596032, 17.410044, 20.482359, 20.882812, 15.978056, 25.201035, 11.329133, 14.594303, 23.173267, 14.173738, 30.972273, 23.646481, 18.168289, 22.698790, 28.380493, 8.438467, 18.264790, 12.133291, 6.331882, 21.258423, 7.839678, 10.214481, 15.611152, 26.110422, 17.508373, 7.181643, 34.287537, 9.827909, 20.607315, 18.717184, 14.403511, 26.323017, 24.976254, 12.786324, 22.058407, 12.491165, 29.944521, 25.560911, 24.509895, 8.844536, 25.867962, 13.633333, 9.785448, 15.509007, 18.762001, 9.568683, 8.045438, 17.255489, 20.260229, 24.026293, 17.116573, 13.316404, 14.078362, 21.071033, 14.099616, 28.754555, 24.097994, 32.617897, 44.334915, 10.496092, 24.061855, 11.461531, 14.680668, 24.525742, 29.383858, 7.088848, 6.693507, 14.264862, 15.160813, 11.989246, 8.258560, 30.855118, 8.047870, 10.763214, 13.499168</max>
		</layer>
		<layer>
			<name>118</name>
			<min>-5.405841, -3.938108, -4.200107, -7.613303, -5.487930, -4.670280, -8.489728, -7.543958, -1.092499, -6.916539, -6.971395, -5.527110, -4.349903, -5.431160, -12.132333, -7.050411, -5.309390, -4.848376, -11.995546, -2.037938, -3.487625, -5.891107, -6.982606, -4.516816, -9.015225, -5.345422, -5.924160, -2.912948, -4.418723, -12.887322, -8.049129, -5.523017, -8.022997, -3.342796, -3.925279, -10.530809, -6.388303, -7.035504, -4.108246, -5.728776, -5.757991, -10.798147, -3.899546, -7.811004, -5.186911, -8.105849, -2.533542, -2.984070, -6.157784, -4.552908, -6.995379, -5.481818, -9.445300, -2.820738, -11.991060, -5.669717, -3.180042, -9.459426, -6.134981, -4.292957, -5.062383, -14.159212, -12.540186, -8.729753</min>
			<max>10.208673, 2.948026, 7.007838, 4.269231, 7.606074, 4.220974, 8.411793, 11.108590, 12.507841, 4.768983, 5.046947, 8.361490, 8.273100, 2.509148, 5.802786, 1.684989, 8.727582, 5.089224, 3.798549, 9.599718, 10.328141, 2.704299, 5.953990, 10.344213, 4.784964, 5.428603, 4.491441, 9.970516, 9.821335, 11.221086, 2.515013, 10.046951, 5.921515, 4.809056, 9.510806, 4.244445, 6.746369, 7.067832, 2.943186, 6.557962, 5.210424, 3.235040, 7.247014, 9.454553, 10.172173, 3.649600, 7.631282, 4.420615, 2.825031, 5.047646, 5.710712, 10.715537, 4.565914, 6.681811, 8.658556, 3.928227, 8.317039, 2.480135, 4.318108, 4.585243, 9.930285, 3.036099, 1.848105, 3.319787</max>
		</layer>
		<layer>
			<name>119</name>
