<?xml version="1.0"?>
<net name="head-pose-estimation-adas-0001" version="3" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="conv1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="relu_conv1" type="ReLU" precision="FP32" id="3">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_840/FusedScaleShift_" type="ScaleShift" precision="FP32" id="4">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128" />
				<weights offset="3736" size="128" />
			</blobs>
		</layer>
		<layer name="pool1" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3864" size="64" />
				<weights offset="3928" size="18432" />
			</blobs>
		</layer>
		<layer name="conv2" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22360" size="256" />
				<weights offset="22616" size="36864" />
			</blobs>
		</layer>
		<layer name="relu_conv2" type="ReLU" precision="FP32" id="7">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_864/FusedScaleShift_" type="ScaleShift" precision="FP32" id="8">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59480" size="256" />
				<weights offset="59736" size="256" />
			</blobs>
		</layer>
		<layer name="pool2" type="Pooling" precision="FP32" id="9">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3" type="Convolution" precision="FP32" id="10">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59992" size="512" />
				<weights offset="60504" size="294912" />
			</blobs>
		</layer>
		<layer name="relu_conv3" type="ReLU" precision="FP32" id="11">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_843/FusedScaleShift_" type="ScaleShift" precision="FP32" id="12">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="355416" size="512" />
				<weights offset="355928" size="512" />
			</blobs>
		</layer>
		<layer name="pool3" type="Convolution" precision="FP32" id="13">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="356440" size="256" />
				<weights offset="356696" size="294912" />
			</blobs>
		</layer>
		<layer name="conv4" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="651608" size="512" />
				<weights offset="652120" size="294912" />
			</blobs>
		</layer>
		<layer name="relu_conv4" type="ReLU" precision="FP32" id="15">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_852/FusedScaleShift_" type="ScaleShift" precision="FP32" id="16">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="947032" size="512" />
				<weights offset="947544" size="512" />
			</blobs>
		</layer>
		<layer name="pool4" type="Pooling" precision="FP32" id="17">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="948056" size="1024" />
				<weights offset="949080" size="1179648" />
			</blobs>
		</layer>
		<layer name="relu_conv5" type="ReLU" precision="FP32" id="19">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_858/FusedScaleShift_" type="ScaleShift" precision="FP32" id="20">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2128728" size="1024" />
				<weights offset="2129752" size="1024" />
			</blobs>
		</layer>
		<layer name="conv_fm" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2130776" size="2048" />
				<weights offset="2132824" size="4718592" />
			</blobs>
		</layer>
		<layer name="angle_y" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6851416" size="512" />
				<weights offset="6851928" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_y_1" type="ReLU" precision="FP32" id="23">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_y_fc" type="FullyConnected" precision="FP32" id="24">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7114072" size="4" />
				<weights offset="7114076" size="2048" />
			</blobs>
		</layer>
		<layer name="angle_r" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7116124" size="512" />
				<weights offset="7116636" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_r_1" type="ReLU" precision="FP32" id="26">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_r_fc" type="FullyConnected" precision="FP32" id="27">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7378780" size="4" />
				<weights offset="7378784" size="2048" />
			</blobs>
		</layer>
		<layer name="angle_p" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7380832" size="512" />
				<weights offset="7381344" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_p_1" type="ReLU" precision="FP32" id="29">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_p_fc" type="FullyConnected" precision="FP32" id="30">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7643488" size="4" />
				<weights offset="7643492" size="2048" />
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Mul_/Fused_Mul_/FusedScaleShift_</name>
			<min>-2.279965, -1.767808, -0.981326</min>
			<max>10.328615, 13.725512, 14.975616</max>
		</layer>
		<layer>
			<name>Mul_840/FusedScaleShift_</name>
			<min>-0.441348, -0.275469, -0.121187, -0.450037, -0.345325, -0.468976, -0.400141, -0.357969, -0.531799, -0.077887, -0.556819, -0.584838, -0.426426, -0.310271, -0.629439, -0.274839, -0.453145, -0.126563, -0.635093, -0.522513, -0.568271, -0.501174, -0.474109, -0.259788, -0.262088, -0.231325, -0.065465, -0.373745, -0.209894, -0.566029, -0.749012, -0.289044</min>
			<max>10.944209, 13.744578, 16.361324, 6.500834, 8.662414, 10.450527, 9.051809, 4.683198, 9.010950, 11.943513, 8.435572, 8.397145, 5.104158, 2.684248, 6.511236, 13.063699, 11.744063, 13.749556, 8.631113, 9.577910, 8.848845, 9.940995, 8.291925, 16.042587, 12.586783, 4.698598, 8.513800, 5.767691, 13.143764, 8.389750, 8.539453, 13.288777</max>
		</layer>
		<layer>
			<name>Mul_843/FusedScaleShift_</name>
			<min>-0.174398, -0.156213, -0.129403, -0.303747, -0.364597, -0.072126, -0.220110, -0.204103, -0.248422, -0.536667, -0.143241, -0.082027, -0.079454, -0.163629, -0.321549, -0.104193, -0.317421, -0.269093, -0.121625, -0.155603, -0.342811, -0.136685, -0.258772, -0.287424, -0.054333, -0.174562, -0.379094, -0.032511, -0.094033, -0.307559, -0.266559, -0.187919, -0.172932, -0.367960, -0.154260, -0.378970, -0.187056, -0.114830, -0.315358, -0.154235, -0.304791, -0.238537, -0.354889, -0.220747, -0.516015, -0.183297, -0.132113, -0.143736, -0.117556, -0.160924, -0.210585, -0.393565, -0.236178, -0.279392, -0.128373, -0.242143, -0.083360, -0.379084, -0.231361, -0.294180, -0.128758, -0.163077, -0.242697, -0.191867, -0.096800, -0.188964, -0.487430, -0.163364, -0.352040, -0.277143, -0.419069, -0.350744, -0.084493, -0.132452, -0.137483, -0.308753, -0.115786, -0.249395, -0.120266, -0.083197, -0.299726, -0.144354, -0.176827, -0.088120, -0.186071, -0.188193, -0.078603, -0.086090, -0.160955, -0.199422, -0.089288, -0.233839, -0.359730, -0.400561, -0.139048, -0.366030, -0.237989, -0.273557, -0.142467, -0.274230, -0.257926, -0.159451, -0.133421, -0.213104, -0.176398, -0.440025, -0.269052, -0.298554, -0.113886, -0.134067, -0.171051, -0.219734, -0.264691, -0.436620, -0.476942, -0.189033, -0.207511, -0.184658, -0.165802, -0.114979, -0.354761, -0.145493, -0.304127, -0.426182, -0.114747, -0.139700, -0.163918, -0.336987</min>
			<max>14.696726, 16.850367, 34.163086, 10.277880, 5.968868, 46.452080, 11.471459, 14.861673, 9.903913, 5.440086, 14.952924, 9.234051, 37.783161, 14.436275, 6.044895, 26.729919, 7.188334, 10.513771, 18.185509, 8.468742, 5.706190, 17.643064, 8.181751, 10.296916, 23.074720, 11.908005, 3.247962, 5.066338, 20.098269, 6.136590, 12.995753, 19.369680, 5.369752, 8.996016, 7.819746, 8.004650, 15.553360, 25.315056, 7.271063, 3.949478, 5.363404, 10.881592, 8.865751, 15.608689, 12.378533, 18.658998, 13.688399, 18.417135, 18.360435, 14.304078, 8.359410, 5.400979, 10.539267, 9.607296, 20.177940, 10.511145, 42.514328, 7.312141, 11.312315, 6.086852, 10.907422, 17.837427, 10.825025, 14.276696, 13.829929, 13.896063, 5.355339, 17.307819, 9.092893, 10.904563, 8.083497, 3.681530, 31.875782, 19.981638, 23.153051, 4.332173, 11.646823, 11.826271, 24.358202, 15.087495, 9.372784, 13.365849, 17.733130, 24.348732, 12.592195, 7.556748, 42.642757, 26.862247, 21.999714, 15.649976, 23.150101, 12.481119, 9.282439, 8.660976, 15.089716, 5.896372, 11.682455, 9.211200, 13.004217, 8.027151, 14.152149, 12.532001, 12.313534, 13.382071, 16.417498, 5.678782, 5.507482, 3.589121, 20.747190, 17.404644, 17.061398, 7.614435, 12.700128, 8.961804, 6.787203, 16.577673, 13.363732, 22.143684, 15.661056, 19.106024, 5.061214, 11.007909, 8.256897, 7.964221, 14.872290, 13.535040, 20.880821, 5.425342</max>
		</layer>
		<layer>
			<name>Mul_852/FusedScaleShift_</name>
			<min>-0.310268, -0.476623, -0.370141, -0.506291, -0.375556, -0.438705, -0.469988, -0.403028, -0.281539, -0.475378, -0.371847, -0.294104, -0.314899, -0.470753, -0.342355, -0.469389, -0.462586, -0.471962, -0.412556, -0.415164, -0.285087, -0.469965, -0.443916, -0.402204, -0.390064, -0.465774, -0.504087, -0.506912, -0.359432, -0.364938, -0.345316, -0.368862, -0.500471, -0.621922, -0.445301, -0.322586, -0.357050, -0.227345, -0.413616, -0.373929, -0.352286, -0.473229, -0.289516, -0.363581, -0.210239, -0.438596, -0.319418, -0.337936, -0.193944, -0.406084, -0.479041, -0.383614, -0.385260, -0.458904, -0.260775, -0.307801, -0.333032, -0.413802, -0.380357, -0.254840, -0.339161, -0.420134, -0.328253, -0.408986, -0.242517, -0.311388, -0.412961, -0.405243, -0.258177, -0.242052, -0.433630, -0.189971, -0.183100, -0.433388, -0.631426, -0.516273, -0.392197, -0.430119, -0.357962, -0.452846, -0.413071, -0.318178, -0.195221, -0.447194, -0.345319, -0.470029, -0.510294, -0.448181, -0.553933, -0.291153, -0.304301, -0.372579, -0.372898, -0.389591, -0.333998, -0.520884, -0.439501, -0.449965, -0.238688, -0.371989, -0.490968, -0.377143, -0.512870, -0.435511, -0.408478, -0.413692, -0.397143, -0.390843, -0.440869, -0.497782, -0.332400, -0.409621, -0.421218, -0.234736, -0.478426, -0.403640, -0.451279, -0.479721, -0.252865, -0.406551, -0.399656, -0.357896, -0.450260, -0.351330, -0.437553, -0.327660, -0.168603, -0.410561</min>
			<max>4.584407, 6.713142, 7.485345, 6.787782, 6.326744, 8.340322, 4.362784, 7.825684, 9.569425, 8.442753, 6.223377, 5.040494, 6.850633, 5.838966, 9.321325, 6.024342, 4.510360, 5.363391, 5.052814, 6.176141, 9.673470, 3.933324, 5.527637, 4.433663, 5.264344, 6.718076, 4.848822, 4.747229, 7.698094, 4.638570, 5.068927, 6.398279, 5.948831, 5.516948, 6.404014, 6.232902, 7.745313, 12.036299, 6.451376, 5.610927, 5.515757, 6.193003, 6.794044, 6.166090, 9.926910, 8.496525, 3.581762, 6.868986, 4.221063, 6.388291, 4.685609, 6.626450, 5.386487, 5.776274, 8.044025, 7.337056, 4.312522, 3.922256, 4.612542, 7.204497, 8.274633, 6.498607, 9.127758, 9.875469, 7.223057, 10.902254, 7.874439, 5.258419, 12.180693, 4.552884, 4.710771, 3.295156, 7.432452, 3.580987, 4.834576, 5.400994, 5.105060, 8.420993, 8.267263, 5.413743, 8.134215, 8.288646, 3.883838, 6.807265, 7.679552, 4.071676, 6.966407, 7.744914, 6.341849, 4.526368, 7.480935, 4.788703, 9.513431, 7.391196, 5.756558, 4.337399, 7.549738, 5.608591, 10.078170, 7.163548, 8.062562, 7.509854, 5.844986, 3.035011, 4.618892, 6.749499, 3.809377, 5.003052, 4.800478, 4.540264, 7.700493, 6.198295, 5.252476, 9.899910, 6.989678, 4.891212, 4.273320, 3.803102, 6.740540, 6.004395, 7.087508, 7.116870, 5.386542, 6.536246, 7.148521, 7.198713, 2.046634, 7.402451</max>
		</layer>
		<layer>
			<name>Mul_858/FusedScaleShift_</name>
			<min>-0.235987, -0.171697, -0.140349, -0.178437, -0.213995, -0.099510, -0.234117, -0.213878, -0.450369, -0.138820, -0.170855, -0.203518, -0.212354, -0.144621, -0.184636, -0.203324, -0.178073, 0.000000, -0.215523, -0.164217, -0.191155, -0.197398, -0.390240, -0.194270, -0.143768, -0.170558, -0.202658, -0.215967, -0.164702, -0.160880, -0.223700, -0.151952, -0.182299, -0.176989, -0.179133, -0.209774, -0.139448, -0.180910, -0.386255, -0.203460, -0.156029, -0.170319, -0.302593, -0.198604, -0.186484, -0.258886, -0.140515, -0.143499, -0.155608, -0.185608, -0.186420, -0.184058, -0.193147, -0.187535, -0.159367, -0.178280, -0.207375, -0.163266, -0.195242, 0.000000, -0.169845, -0.158481, -0.220442, -0.178941, -0.238716, -0.214869, 0.000000, -0.213676, -0.187558, -0.231446, -0.149273, -0.291805, -0.157182, -0.186534, -0.186442, -0.157672, -0.462789, 0.000000, -0.172507, -0.150422, -0.168903, -0.215411, -0.147298, -0.257564, -0.192405, -0.161762, -0.171950, -0.232500, -0.237529, -0.559401, -0.225252, -0.226695, -0.302685, -0.108680, -0.161610, -0.175315, -0.134642, -0.171903, -0.167083, 0.000000, -0.187197, -0.198734, -0.177792, -0.176127, -0.184308, -0.143050, -0.194889, -0.172107, -0.183492, -0.254828, -0.181438, -0.237080, -0.214792, -0.193889, -0.157063, -0.106263, -0.221285, -0.220076, -0.220660, -0.158221, -0.201999, -0.135401, -0.146942, -0.195712, -0.219544, -0.155509, -0.168044, 0.000000, -0.249598, -0.206129, -0.488849, -0.147683, -0.248260, -0.165023, -0.143471, -0.147700, -0.132555, -0.162901, -0.147198, -0.364712, 0.000000, -0.188061, -0.196676, -0.188150, -0.143857, 0.000000, -0.157390, -0.185158, -0.226519, -0.183026, -0.152325, -0.179172, -0.192614, -0.267033, -0.183445, -0.369344, -0.133568, -0.179355, -0.386947, -0.172587, -0.231926, -0.253205, -0.126303, -0.175771, -0.170086, -0.172574, -0.145434, -0.195384, -0.173810, 0.000000, -0.202327, -0.140041, -0.231047, -0.137640, -0.227678, 0.000000, -0.177139, -0.157323, -0.201023, -0.214041, -0.164713, -0.201491, -0.134448, -0.266983, -0.180075, -0.308357, -0.252362, -0.218788, -0.250584, -0.196589, -0.206014, -0.133494, -0.256937, 0.000000, -0.236310, -0.179414, -0.180079, -0.199539, -0.238744, -0.140492, -0.203689, -0.121279, -0.203712, -0.162934, -0.199780, -0.174599, -0.169579, -0.204460, -0.255420, -0.178307, -0.230621, -0.173764, 0.000000, -0.178700, -0.196863, -0.179611, -0.192894, -0.218354, -0.205061, -0.238343, -0.176522, -0.170796, -0.176572, 0.000000, -0.190787, -0.167217, -0.206294, -0.198810, -0.220694, -0.159826, -0.304988, -0.180425, -0.180802, -0.178558, -0.196649, -0.209225, -0.388742, -0.140588, -0.178824, -0.197021, -0.124414, -0.184024, -0.163563, -0.200260, -0.190343, -0.211427, -0.210205, -0.248570, -0.235509, -0.141873, -0.206181, -0.176008, -0.161421, -0.172550, -0.176141, -0.196768</min>
			<max>6.898043, 9.575953, 2.240977, 10.293046, 8.262177, 19.130630, 3.281071, 8.097269, 3.460420, 11.773894, 8.949545, 10.768717, 3.133658, 9.351950, 4.739436, 8.476649, 8.661485, 0.000000, 6.925113, 10.525506, 9.366689, 5.939292, 3.827435, 9.398113, 7.372912, 6.667075, 3.684630, 6.491537, 11.994906, 12.100281, 10.167375, 5.621850, 5.768852, 8.195423, 5.980869, 5.666957, 16.475185, 11.637778, 5.319345, 7.337784, 10.089487, 7.876716, 6.045082, 12.677479, 8.718632, 5.312859, 17.814102, 14.696619, 5.948691, 10.536344, 5.883426, 7.246326, 8.070313, 11.211804, 6.431952, 8.470870, 14.167242, 9.806895, 10.063993, 0.000000, 5.672106, 10.991291, 8.489178, 11.805627, 7.284094, 10.086497, 0.000000, 6.608193, 7.758678, 7.137153, 8.564487, 3.611570, 10.640989, 9.758664, 10.853415, 9.619278, 6.010974, 0.000000, 6.529143, 7.804961, 9.769990, 6.957292, 7.173792, 2.678268, 7.538560, 8.974911, 10.173634, 5.503956, 8.467106, 2.756884, 8.718341, 6.864985, 3.382770, 9.560749, 10.259838, 7.343090, 8.569190, 5.216514, 11.810752, 0.000000, 8.880998, 7.305688, 6.103824, 7.721691, 8.544876, 11.769392, 3.927479, 11.482997, 7.260132, 6.124731, 7.096617, 9.812245, 6.897326, 9.729136, 5.080487, 9.339443, 7.594409, 6.443646, 4.178274, 5.782187, 9.864675, 10.188980, 6.253140, 8.143403, 9.611168, 6.660481, 17.289371, 0.000000, 7.208470, 7.152091, 5.401114, 7.351593, 7.437618, 4.908682, 10.613867, 10.825598, 7.425922, 10.121861, 4.143424, 5.737741, 0.000000, 4.153296, 9.679495, 9.348120, 7.560895, 0.000000, 7.243149, 7.412888, 11.335643, 7.211052, 11.317769, 10.549490, 9.786218, 7.788675, 4.479443, 4.691658, 8.786498, 7.125931, 3.507416, 4.031768, 7.334504, 3.458610, 7.723871, 6.529622, 8.545899, 10.054596, 4.608454, 8.721272, 11.214866, 0.000000, 8.456724, 13.241736, 4.926000, 8.713369, 5.139740, 0.000000, 5.032034, 8.117276, 12.753264, 5.873797, 8.977555, 6.519296, 12.908693, 6.749619, 8.926002, 5.814219, 8.165528, 5.570392, 6.864317, 8.324271, 9.058759, 11.772195, 2.036424, 0.000000, 4.393345, 5.593552, 12.722694, 8.152139, 6.687197, 9.421528, 9.474545, 2.653091, 6.950408, 6.292408, 6.099383, 10.373063, 8.280772, 11.238652, 6.078450, 8.280122, 6.823434, 7.095261, 0.000000, 6.750862, 7.478584, 7.711932, 10.648511, 5.080748, 6.170455, 8.973157, 9.363413, 6.795685, 8.947197, 0.000000, 9.470365, 6.089274, 2.660831, 8.630751, 5.576719, 4.425740, 4.215595, 5.249496, 5.583868, 9.390769, 6.770131, 6.382627, 4.036569, 3.904126, 6.141202, 4.780306, 10.271870, 6.396989, 8.395181, 7.036295, 6.985239, 7.003582, 11.429439, 5.780404, 7.515420, 12.987889, 7.106579, 5.456682, 10.496473, 9.945246, 6.234385, 6.257163</max>
		</layer>
		<layer>
			<name>Mul_864/FusedScaleShift_</name>
			<min>-0.257477, -0.720593, -0.575267, -0.329450, -0.338182, -0.642775, -0.741861, -0.233543, -0.605312, -0.222677, -0.338808, -0.214751, -0.264674, -0.553350, -0.566547, -0.620641, -0.741759, -0.363119, -0.244806, -0.182979, -0.517078, -0.330867, -0.268878, -0.703369, -0.216959, -0.331745, -0.424957, -0.393275, -0.364181, -0.635921, -0.332647, -0.322474, -0.216883, -0.352082, -0.272187, -0.553506, -0.436308, -0.249546, -0.273735, -0.558075, -0.689657, -0.368924, -0.255182, -0.416987, -0.459612, -0.414634, -0.429915, -0.473848, -0.212910, -0.270324, -0.692801, -0.384506, -0.378567, -0.294875, -0.379531, -0.262425, -0.337172, -0.420118, -0.565965, -0.264076, -0.362497, -0.342764, -0.402615, -0.503290</min>
			<max>14.147449, 5.996660, 5.197913, 7.281283, 10.457274, 7.826660, 4.621794, 10.050924, 6.523620, 7.776685, 13.712501, 11.499685, 9.916225, 5.912745, 7.500093, 10.779013, 5.388405, 8.188064, 7.518119, 8.771522, 6.126468, 8.239996, 12.421284, 3.053294, 11.484408, 11.254205, 6.480115, 6.716293, 15.077918, 7.712538, 7.872289, 9.553458, 12.216383, 6.404362, 8.756176, 5.576643, 7.922816, 11.263861, 12.187979, 6.764004, 5.589407, 13.268364, 11.473438, 10.489759, 10.426784, 6.869377, 9.317289, 9.773501, 7.756513, 11.553055, 6.119197, 11.171127, 5.583348, 11.991893, 20.236822, 12.324004, 15.708344, 11.027966, 7.188963, 9.595172, 4.146229, 10.928203, 7.956670, 7.123014</max>
		</layer>
		<layer>
			<name>angle_p</name>
			<min>-3.354747, -3.266343, -7.458018, -4.232597, -4.361713, -4.281390, -4.503966, -3.700792, -4.322551, -3.663488, -4.291001, -5.000430, -3.242076, -5.771100, -3.460798, -7.443715, -3.955535, -4.354082, -3.210710, -3.689015, -1.487543, -3.620685, -4.392208, -3.678763, -4.670934, -3.397053, -3.381587, -4.265432, -3.245159, -3.412584, -4.087525, -3.903686, -4.182632, -4.578207, -1.754377, -1.617183, -4.442305, -4.256403, -4.259363, -3.175324, -4.048479, -4.372614, -3.397851, -3.867450, -4.943741, -5.081618, -4.277270, -4.396358, -3.547289, -4.475037, -4.170567, -4.201973, -4.206075, -4.978760, -6.531847, -3.359095, -4.381076, -4.991932, -3.532455, -4.357109, -3.690625, -4.702333, -3.504344, -3.321462, -3.490446, -3.468674, -4.377219, -4.989420, -4.323204, -4.316630, -3.647789, -3.730610, -4.537147, -4.440652, -4.218895, -4.004238, -3.296615, -4.204959, -2.082730, -4.691286, -5.950574, -4.658705, -3.627850, -4.305270, -3.444808, -3.440314, -4.273416, -3.222135, -4.949390, -4.235876, -1.637127, -7.098605, -4.197674, -2.794678, -4.369412, -4.127602, -4.238154, -4.329322, -4.367397, -4.035515, -4.203105, -4.940783, -4.345239, -4.111317, -4.339628, -4.210465, -4.282254, -4.407759, -3.314991, -4.388571, -3.272072, -3.362470, -4.275113, -4.140246, -4.461792, -3.312022, -4.253796, -4.319177, -4.060688, -4.472673, -3.349558, -7.441926, -4.296767, -2.738168, -1.738346, -4.350411, -3.356461, -4.292656</min>
			<max>4.872325, 5.040445, 0.490772, 3.978268, 3.858431, 4.047925, 2.528465, 7.928841, 3.928659, 7.637738, 4.010164, 3.328049, 5.892409, 1.880441, 4.784722, 0.631527, 3.436276, 3.927167, 5.044097, 5.861334, 11.567696, 7.713986, 3.917598, 7.781885, 1.490256, 4.780520, 4.839967, 4.004731, 4.807217, 4.684090, 4.077445, 8.123019, 1.877356, 3.412878, 4.836512, 11.173585, 3.016411, 4.128425, 4.066069, 5.991347, 3.209643, 4.059904, 4.824463, 3.579376, 2.108483, 2.577667, 4.045184, 2.358316, 4.757260, 1.543346, 4.089696, 4.053856, 4.210537, 3.597593, 1.629823, 4.773931, 4.009731, 1.667695, 5.844346, 3.965927, 4.191172, 6.270390, 6.023903, 4.738975, 7.718185, 4.763429, 1.845321, 3.376399, 1.892665, 4.032071, 4.233935, 7.705048, 3.186778, 3.860718, 4.006722, 1.925954, 5.894883, 4.153662, 9.448726, 4.019197, 0.829205, 3.432469, 7.902002, 1.878317, 4.685160, 4.754939, 4.121095, 5.945160, 3.803008, 4.130133, 5.580633, 1.214830, 4.118317, 8.445582, 3.910331, 1.800002, 4.154321, 4.122145, 1.587888, 1.865065, 1.940436, 6.448193, 4.063654, 4.215564, 4.025637, 4.183746, 4.063897, 1.996745, 5.920115, 3.964643, 5.846117, 4.771784, 4.020355, 4.029553, 1.675094, 4.816214, 3.959367, 4.025970, 2.300958, 3.903627, 4.767365, 1.354387, 3.980616, 8.572968, 11.006562, 3.933797, 4.781668, 4.113926</max>
		</layer>
		<layer>
			<name>angle_r</name>
			<min>-2.238246, -3.116964, -2.223822, -2.302543, -2.952854, -1.851414, -2.024657, -2.190766, -2.199445, -2.220895, -2.285196, -1.610695, -2.766686, -1.923017, -1.900998, -1.660898, -2.138275, -2.342175, -2.069246, -2.109983, -2.428051, -2.095898, -1.486289, -2.132000, -1.981149, -2.047668, -1.671475, -1.575764, -1.570939, -2.064302, -2.062687, -2.518578, -2.657684, -2.198003, -1.640796, -1.588425, -2.771592, -2.055628, -1.329222, -1.665445, -1.990527, -2.300932, -2.276190, -2.358285, -2.007845, -2.056162, -2.429973, -2.305742, -1.824523, -2.018573, -2.267020, -2.821787, -2.739761, -2.018005, -1.957250, -2.189319, -1.843685, -2.524297, -2.125416, -2.015253, -2.423168, -2.473178, -2.258904, -2.068517, -2.104755, -2.041282, -2.116091, -2.177834, -2.749579, -2.116265, -1.909667, -2.131596, -2.108660, -2.122299, -2.160595, -2.411555, -2.074137, -2.201366, -2.104570, -1.946001, -1.675510, -2.082359, -2.096049, -2.367742, -2.025871, -2.297339, -2.078825, -2.302571, -2.029063, -2.418066, -1.988318, -1.994976, -1.917354, -2.223418, -2.099803, -2.148318, -1.996530, -2.299272, -2.126350, -2.332191, -2.322057, -2.402333, -2.377968, -2.235444, -1.892801, -2.062577, -2.089621, -2.245524, -1.983636, -2.244267, -1.926467, -1.995330, -2.017776, -2.355930, -2.089840, -2.077466, -2.497538, -2.231294, -0.973810, -2.091714, -2.355819, -2.083114, -2.041444, -2.010482, -2.043422, -2.380592, -2.342577, -2.417534</min>
			<max>2.359364, 2.730954, 2.206170, 1.047372, 2.196284, 2.430272, 3.005679, 1.456642, 1.476881, 1.601109, 2.458138, 2.749390, 2.768609, 1.269706, 1.543608, 2.077155, 2.847042, 1.063424, 2.512472, 2.084523, 0.961134, 1.038404, 1.612917, 0.993945, 1.592170, 1.354939, 2.405947, 1.651055, 1.893909, 1.349696, 0.990902, 1.220234, 2.582196, 0.946837, 2.395996, 2.489907, 2.580750, 2.356760, 2.118108, 2.285656, 2.155973, 1.419776, 1.299945, 1.188239, 1.556244, 0.898509, 1.079861, 2.548347, 2.540942, 1.441183, 2.788239, 1.873240, 3.547940, 1.511377, 2.909263, 2.074912, 1.948169, 1.104490, 2.523650, 1.039302, 2.014661, 2.339162, 2.763750, 2.099087, 1.052128, 1.740300, 1.104813, 2.569230, 3.481893, 2.022290, 1.114102, 1.634045, 2.204070, 1.087293, 1.046013, 1.850950, 0.977656, 2.770821, 1.487546, 1.182255, 1.384135, 1.769143, 1.262299, 1.052889, 1.326992, 3.051218, 1.064745, 2.633507, 2.457769, 1.237433, 1.994166, 2.403829, 1.239568, 1.284544, 1.338502, 1.467268, 1.333923, 3.033370, 1.513991, 1.241569, 1.040939, 1.999712, 1.104092, 2.125970, 1.910461, 0.896370, 1.096212, 2.997261, 1.086610, 1.064470, 1.416189, 1.424728, 1.598046, 1.955953, 1.446882, 1.175918, 1.497259, 1.513266, 2.389399, 1.415765, 1.068301, 0.971283, 1.295560, 1.214832, 1.274497, 1.085481, 1.430704, 1.079218</max>
		</layer>
		<layer>
			<name>angle_y</name>
			<min>-3.435297, -3.311483, -3.937670, -4.753676, -3.319256, -3.788941, -4.067979, -4.398391, -3.899465, -4.089288, -4.764424, -5.407657, -3.737304, -3.408922, -3.829607, -4.581315, -4.470050, -4.685422, -4.154281, -4.674987, -4.049580, -2.731685, -3.920699, -4.186877, -3.320917, -4.530372, -4.670312, -6.594038, -5.451906, -4.638686, -4.757453, -4.338236, -3.160949, -4.481638, -3.502544, -3.554904, -3.423124, -3.428137, -3.809438, -5.978570, -2.354490, -3.431398, -3.227600, -3.097196, -5.270687, -4.143790, -4.534885, -3.958822, -3.861119, -3.560781, -4.100176, -3.324187, -5.184358, -5.543633, -4.334781, -6.675366, -3.413001, -4.598296, -4.163984, -3.384575, -3.904914, -4.172095, -3.643456, -5.433712, -6.452957, -3.571676, -6.656474, -5.507032, -3.312485, -3.231115, -3.922474, -4.134780, -5.276520, -4.538866, -3.360654, -3.972901, -3.507048, -4.475599, -4.552909, -3.933523, -2.908788, -3.984231, -4.352977, -6.681194, -4.571593, -3.926425, -4.951531, -4.497216, -3.821609, -2.974670, -3.964027, -5.504563, -5.174187, -3.932245, -4.092729, -3.536425, -6.804768, -4.197080, -3.935013, -5.003073, -3.022590, -3.875863, -6.516699, -4.617431, -6.460378, -2.426764, -3.981385, -4.055588, -3.985030, -5.867706, -3.961539, -3.175088, -4.126240, -4.117589, -3.928317, -4.828701, -5.086735, -3.606415, -4.273455, -3.488307, -4.114021, -4.041330, -4.506289, -5.091164, -3.917100, -3.952683, -6.587911, -4.317295</min>
			<max>3.482663, 4.171769, 7.812880, 5.221395, 3.733966, 3.117277, 7.597712, 4.198171, 5.710940, 7.498620, 3.960218, 4.299876, 3.274494, 4.244327, 3.149778, 2.371396, 4.149932, 5.303679, 7.803264, 2.394799, 7.484775, 3.663704, 7.330412, 7.465944, 4.268254, 4.112823, 4.247314, 3.204934, 3.596322, 4.221958, 5.719516, 4.252991, 4.100351, 4.145191, 4.766119, 4.413487, 3.592968, 4.691300, 3.152130, 3.892990, 8.653927, 4.523161, 4.656908, 4.864956, 2.698110, 7.624562, 4.199865, 7.725668, 7.251577, 3.642401, 7.597980, 4.394622, 2.397549, 4.168314, 4.288721, 3.146641, 4.996705, 3.553799, 7.551145, 4.567384, 7.568949, 7.483825, 4.017590, 2.757878, 1.896118, 3.154768, 3.240669, 2.406970, 4.796113, 4.786018, 7.546943, 7.598259, 2.707554, 4.212903, 4.810114, 3.187120, 4.803272, 4.123741, 6.484716, 7.231887, 5.059978, 7.436157, 4.238598, 2.032794, 4.120363, 7.585640, 4.721271, 4.164840, 4.962586, 3.856335, 7.592045, 2.695039, 2.512668, 7.450810, 7.588878, 4.267524, 2.094208, 1.063918, 6.191790, 2.531221, 3.292473, 7.856383, 3.215724, 4.172417, 2.964633, 8.691576, 7.555886, 7.688603, 7.497190, 3.702079, 7.392414, 4.615942, 7.422791, 7.580225, 7.176984, 4.081973, 3.343406, 3.376721, 3.580675, 4.285038, 7.644145, 7.809019, 4.209496, 3.174176, 7.177731, 7.376341, 2.213636, 2.996998</max>
		</layer>
		<layer>
			<name>conv1</name>
			<min>-25.606861, -69.506966, -29.769348, -30.109507, -33.056965, -44.110470, -27.793190, -31.385109, -47.264595, -22.357862, -54.140728, -18.469065, -27.682468, -36.995090, -13.991831, -74.633980, -42.133274, -29.266119, -15.689981, -40.419716, -49.501072, -52.306625, -26.207413, -78.323875, -81.847710, -69.566780, -20.553520, -36.911163, -39.974297, -50.966274, -16.395418, -70.250999</min>
			<max>30.217291, 78.406372, 21.621475, 8.561536, 20.335920, 47.698318, 24.406971, 4.367000, 53.612370, 12.751200, 49.021931, 18.791147, 22.742168, 2.843574, 27.440758, 52.301201, 59.782707, 17.769085, 24.542603, 45.513973, 56.667839, 48.299591, 24.362888, 65.827057, 52.204880, 3.828366, 11.069959, 8.401039, 19.180178, 52.714054, 27.860279, 72.854477</max>
		</layer>
		<layer>
			<name>conv2</name>
			<min>-133.198074, -153.880020, -87.439476, -85.847633, -170.179779, -99.602531, -121.404922, -104.505249, -71.755966, -109.274200, -139.486954, -87.908798, -101.233803, -184.597610, -150.918320, -158.171280, -80.886208, -106.153648, -84.069511, -114.532471, -157.545288, -90.630310, -87.665733, -94.601227, -89.407753, -124.362267, -149.037415, -102.209328, -108.078094, -104.632027, -61.387917, -140.253494, -104.790604, -86.235130, -134.285004, -206.161682, -92.578987, -123.522972, -155.264145, -176.856003, -229.460785, -142.926529, -112.770737, -95.258247, -127.584152, -166.815094, -177.865646, -127.875465, -126.653770, -127.135201, -329.890533, -114.427467, -96.555717, -52.062195, -130.280106, -110.489632, -157.697830, -140.500198, -146.631119, -72.485794, -88.869728, -111.449684, -59.710407, -186.920990</min>
			<max>62.056236, 37.859715, 46.832127, 71.275581, 36.763126, 77.064125, 44.793438, 44.478073, 76.895660, 47.557308, 72.479912, 54.635098, 36.572201, 34.986443, 36.486210, 60.425697, 41.149136, 75.772278, 40.151089, 29.998198, 41.746902, 34.282810, 48.891563, 35.201477, 35.874516, 69.683479, 30.881258, 72.847130, 91.093719, 45.117855, 71.931160, 46.841194, 40.554802, 56.452198, 60.913837, 26.116714, 48.463657, 34.581921, 46.876072, 37.729073, 37.720203, 56.314262, 44.289883, 41.470802, 40.803352, 31.040487, 41.869297, 39.134075, 17.391041, 55.081924, 37.402588, 65.166260, 46.331821, 58.690521, 123.388817, 57.859699, 92.413223, 46.309361, 35.783993, 46.213177, 54.936581, 43.332024, 42.243954, 39.275200</max>
		</layer>
		<layer>
			<name>conv3</name>
			<min>-23.428104, -24.693520, -21.771339, -29.687462, -15.757691, -23.996941, -20.081236, -28.257034, -20.936668, -51.096733, -26.663998, -67.229767, -25.697945, -25.213974, -18.435240, -28.598492, -15.353565, -29.779745, -28.252605, -28.486557, -17.394997, -30.355782, -38.655888, -36.487404, -28.287941, -34.965553, -12.608961, -40.375950, -33.811756, -21.179823, -29.422064, -22.871763, -24.011654, -31.496544, -29.760498, -31.184958, -26.324860, -24.409859, -22.585283, -29.377735, -22.486309, -24.893620, -48.444565, -22.722794, -19.059689, -30.060410, -27.799698, -32.550964, -26.872581, -28.577835, -24.215427, -22.394814, -25.113791, -14.152569, -33.076885, -29.790043, -24.952017, -28.264202, -27.437355, -28.854019, -36.324104, -24.155552, -28.681850, -26.901546, -27.401386, -26.500029, -17.179993, -28.226385, -42.570210, -28.908825, -29.339214, -9.725884, -28.943254, -23.163301, -32.346214, -15.875278, -42.179420, -24.764322, -33.406971, -32.940914, -25.257786, -25.389814, -17.878424, -28.112732, -29.808172, -30.124664, -27.652945, -26.057110, -23.580978, -31.297005, -25.554855, -17.556040, -35.347595, -32.889835, -28.629082, -29.777328, -17.764706, -20.674364, -42.921959, -20.319910, -41.378147, -31.365334, -24.968874, -33.560017, -23.887299, -43.180420, -18.464703, -27.656830, -23.893681, -22.933392, -33.065392, -26.986282, -18.895803, -52.217110, -47.040432, -22.482391, -22.335091, -27.451708, -27.478630, -25.207703, -24.670506, -31.967339, -25.350414, -40.654861, -25.236609, -31.222401, -22.290323, -34.454212</min>
			<max>9.600961, 10.680256, 24.696182, 12.493032, 29.561569, 13.694679, 15.031575, 14.102854, 13.248636, 14.656221, 7.740885, 2.922279, 11.783083, 14.034395, 8.824545, 13.044250, 10.725464, 14.145952, 7.999228, 4.498194, 9.497385, 10.052713, 6.798748, 16.160788, 5.932355, 7.657183, 11.104022, 0.691215, 7.863791, 8.846209, 16.876026, 13.370211, 4.815666, 17.376644, 4.865274, 12.617479, 14.691134, 14.590799, 12.906888, 2.880503, 7.014045, 10.264997, 14.707147, 16.128212, 30.773581, 13.904289, 7.994220, 11.852196, 9.275827, 9.874283, 8.429410, 10.612751, 10.895148, 14.172091, 10.954437, 12.096090, 12.755859, 14.412716, 11.502382, 8.879081, 5.271588, 12.613593, 11.617131, 11.925558, 5.168516, 11.783807, 16.384008, 12.150640, 15.616049, 15.682583, 18.235723, 12.881416, 10.244991, 14.208690, 10.531584, 10.985005, 4.656348, 15.273663, 12.580069, 6.029924, 13.780668, 9.360270, 17.637533, 10.627657, 11.510209, 5.785297, 15.841805, 10.852909, 12.135095, 13.096798, 9.421783, 13.749263, 13.490907, 14.147996, 8.962082, 10.554829, 15.868675, 14.441064, 6.087308, 12.182508, 17.677616, 10.764497, 7.871589, 12.371909, 15.739840, 12.888912, 12.954292, 5.703756, 10.621206, 11.308849, 18.329220, 9.269236, 17.106260, 19.936922, 15.141960, 12.879949, 13.639356, 17.239697, 11.489403, 9.095797, 18.743492, 5.271268, 11.563887, 16.094452, 8.761758, 6.445153, 17.883057, 7.845444</max>
		</layer>
		<layer>
			<name>conv4</name>
			<min>-59.104729, -84.545357, -67.347450, -56.088387, -54.402424, -56.771042, -64.131058, -39.603062, -58.086227, -46.550636, -67.080544, -64.010384, -48.327084, -91.941879, -56.019390, -37.430634, -56.173542, -50.930538, -51.208786, -94.411026, -67.599571, -49.147514, -26.604210, -63.309353, -54.996578, -82.182503, -45.675133, -92.513870, -83.950966, -50.896191, -63.593761, -64.530540, -61.311859, -16.154518, -39.863468, -55.128983, -85.254250, -63.328003, -69.617928, -43.600681, -55.135517, -70.489822, -75.062668, -88.841652, -48.570309, -119.668854, -46.188137, -56.633503, -54.304523, -68.213852, -39.987785, -69.084793, -41.513683, -76.713226, -55.344185, -75.025505, -52.043865, -44.567940, -64.972855, -64.991768, -74.733047, -43.756065, -37.575722, -72.544868, -47.711315, -54.751564, -70.283287, -52.616798, -46.868347, -65.788010, -53.176262, -49.688892, -56.276638, -52.137882, -61.945610, -50.310913, -48.886513, -51.877403, -55.850933, -78.207596, -85.870087, -61.245022, -63.043709, -83.123657, -55.408363, -52.862041, -65.380188, -56.206711, -45.749695, -61.719570, -43.903671, -48.892258, -58.538647, -47.493069, -61.919102, -56.865459, -71.829689, -43.223404, -59.158829, -90.019547, -74.987511, -52.175446, -68.081215, -35.681923, -60.718708, -69.767059, -48.673622, -58.015575, -58.111912, -45.171791, -65.975876, -71.127586, -52.070488, -53.965790, -46.354630, -51.490612, -56.064095, -61.453018, -61.109154, -53.173401, -73.297966, -63.296318, -60.483078, -49.127174, -82.849907, -50.324738, -63.860466, -58.786896</min>
			<max>30.444588, 51.431080, 59.709690, 56.320282, 32.867767, 65.155548, 31.433746, 52.265171, 64.764290, 60.381607, 49.002968, 23.425507, 44.391304, 47.524460, 57.156868, 46.329094, 35.307739, 43.002789, 33.941612, 46.099632, 66.270744, 25.961548, 44.816822, 33.330151, 37.847977, 48.014568, 40.304161, 41.928974, 60.918148, 27.274426, 25.833759, 44.790165, 45.644264, 52.354233, 42.789970, 32.693504, 58.692326, 49.303715, 41.403973, 40.453358, 31.620781, 51.946491, 34.406765, 43.015884, 44.050018, 70.678558, 22.701235, 41.289703, 21.634542, 44.720215, 38.356808, 41.111671, 30.778078, 48.081352, 40.280174, 50.817459, 27.567631, 25.973301, 25.887512, 50.113972, 46.277855, 51.999748, 59.146206, 71.806114, 34.858425, 47.894970, 68.551056, 40.365414, 61.644230, 28.466606, 29.917919, 14.569203, 30.524788, 27.122217, 47.337933, 48.753372, 41.050446, 64.640068, 57.693890, 41.261810, 52.830513, 56.750393, 18.571047, 53.671555, 52.141563, 28.381786, 55.871147, 56.069244, 61.459240, 19.549831, 49.615929, 36.410446, 63.161789, 46.469070, 32.106312, 36.016106, 62.086819, 44.093254, 44.043823, 56.971828, 67.882599, 56.222801, 49.534420, 24.210957, 31.391491, 44.112289, 24.520628, 29.557833, 32.635189, 37.731506, 40.980022, 45.877396, 43.403454, 42.941971, 53.209225, 38.427727, 31.214386, 34.172722, 36.686584, 35.006561, 43.121880, 42.799564, 37.814972, 36.167839, 57.242973, 46.868328, 8.586086, 46.402367</max>
		</layer>
		<layer>
			<name>conv5</name>
